       01 OCCURS-SAMPLE-RECORD.
          05 CUSTOMER-NAME PIC N(10).
          05 ITEM-CODE     PIC X(4) OCCURS 3 TIMES.
          05 ITEM-COUNT    PIC 9(3) OCCURS 3 TIMES.
          05 TOTAL-AMOUNT  PIC S9(7) COMP-3.
