       01 SAMPLE-ENGLISH-RECORD.
          05 CUSTOMER-NAME PIC N(10).
          05 EN-NAME       PIC XXXXXX.
          05 AGE           PIC 999V99.
          05 AMOUNT        PIC S9(9) COMP-3.
          05 AMOUNT-RAW    REDEFINES AMOUNT PIC X(5).
