       01 SAMPLE-RECORD.
          05 名前       PIC N(10).
          05 英名       PIC X(10).
          05 年齢       PIC 9(2)V9(1).
          05 体重       PIC S9(3)V9(2).
          05 攻撃力     PIC S9(9) COMP-3.
